readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Penpal</title>
<!-- 2015-04-16 Thu 15:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Benjamin Zaporzan" />
<meta  name="description" content="Readme documentation on penpal javascript library"
 />
<meta  name="keywords" content="javascript, messaging, iframes, frames, external windows" />
</head>
<body>
<div id="content">
<h1 class="title">Penpal</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Features and Operation</a></li>
<li><a href="#sec-2">2. A Basic Example</a></li>
<li><a href="#sec-3">3. Configuration</a></li>
<li><a href="#sec-4">4. Download</a></li>
<li><a href="#sec-5">5. Usage Notes</a>
<ul>
<li><a href="#sec-5-1">5.1. Extending our objects to serve data</a></li>
<li><a href="#sec-5-2">5.2. Examples of extending the server</a></li>
<li><a href="#sec-5-3">5.3. Handling errors</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Javascript API</a></li>
</ul>
</div>
</div>
<p>
Penpal is a Request-Response Messaging System that works between
frames, iframes and external windows.
</p>

<p>
It leverages the power of <a href="http://github.com/benzap/flyer.js">flyer.js</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Features and Operation</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Define a <b>server prototype</b>, and create server instances from it.
</li>
<li>Responses from server instances are returned in the form of a Promise Object
</li>
<li>Create clients which communicate to the server by a unique keyword
defining the server instance
</li>
<li>Server instances can be easily extended into any application
through the use of any object reference
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> A Basic Example</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-js"><span style="color: #6F8F6F;">//</span><span style="color: #7F9F7F;">Define our echo server</span>
<span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">EchoServer</span> = Penpal.newServer(<span style="color: #8CBED6;">"EchoServer"</span>, {
  <span style="color: #D65921;">echo</span>: <span style="color: #DEC77B;">function</span>(<span style="color: #EFA252;">value</span>) {
    <span style="color: #DEC77B;">return</span> value;
  }
});

<span style="color: #6F8F6F;">//</span><span style="color: #7F9F7F;">Create a server instance with a unique keyword</span>
EchoServer.start(<span style="color: #8CBED6;">"main"</span>);

<span style="color: #6F8F6F;">//</span><span style="color: #7F9F7F;">Create a client to communicate to our server instance</span>
<span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">client</span> = EchoServer.newClient(<span style="color: #8CBED6;">"main"</span>);

<span style="color: #6F8F6F;">//</span><span style="color: #7F9F7F;">Use our client to echo to the server</span>
<span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">response</span> = client.echo(<span style="color: #8CBED6;">"Hello World!"</span>);

<span style="color: #6F8F6F;">//</span><span style="color: #7F9F7F;">retrieve the response from our returned promise</span>
response.done(<span style="color: #DEC77B;">function</span>(<span style="color: #EFA252;">responseString</span>) {
  console.log(<span style="color: #8CBED6;">"Client Received the response: "</span>, responseString); <span style="color: #6F8F6F;">//</span><span style="color: #7F9F7F;">Hello World!</span>
});
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Configuration</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>penpal.js</b> uses the parent project <a href="http://github.com/benzap/flyer.js">flyer.js</a> to magically send
messages between frames, iframes, and external windows. You can
grab the version I used from <a href="https://github.com/benzap/flyer.js/releases/download/v1.1.0/flyer.min.js">here</a>
</p>

<p>
I also used jquery $.Deferred (jquery 1.11.0) for the promise
functionality, which was obtained from the CDN. As long as your
version of Jquery has $.Deferred, it should work.
</p>

<p>
Here is what would be required at the end of your page body:
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #D65921;">script</span> <span style="color: #EFA252;">src</span>=<span style="color: #8CBED6;">"//code.jquery.com/jquery-1.11.0.min.js"</span>&gt;&lt;/<span style="color: #D65921;">script</span>&gt;
&lt;<span style="color: #D65921;">script</span> <span style="color: #EFA252;">src</span>=<span style="color: #8CBED6;">"flyer.min.js"</span>&gt;&lt;/<span style="color: #D65921;">script</span>&gt;
&lt;<span style="color: #D65921;">script</span> <span style="color: #EFA252;">src</span>=<span style="color: #8CBED6;">"penpal.js"</span>&gt;&lt;/<span style="color: #D65921;">script</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Download</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://github.com/benzap/penpal.js/releases/tag/v0.0.1">Version 0.0.1</a>
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Usage Notes</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Extending our objects to serve data</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Say we have listing of Food Items being displayed on the page. This
listing of food items is controlled by the Object FoodManager
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">FoodManager</span> = <span style="color: #DEC77B;">function</span>() {
  <span style="color: #DEC77B;">this</span>.listing = [];
}

FoodManager.<span style="color: #DEC77B;">prototype</span>.addFoodItem = <span style="color: #DEC77B;">function</span>(<span style="color: #EFA252;">name</span>) {
  <span style="color: #DEC77B;">this</span>.listing.push(name);
  <span style="color: #DEC77B;">return</span> <span style="color: #DEC77B;">this</span>;
}

FoodManager.<span style="color: #DEC77B;">prototype</span>.removeFoodByName = <span style="color: #DEC77B;">function</span>(<span style="color: #EFA252;">name</span>) {
  <span style="color: #DEC77B;">this</span>.listing = <span style="color: #DEC77B;">this</span>.listing.filter(<span style="color: #DEC77B;">function</span>(<span style="color: #EFA252;">n</span>) { n != name });
}

FoodManager.<span style="color: #DEC77B;">prototype</span>.getFoodListing = <span style="color: #DEC77B;">function</span>(<span style="color: #EFA252;">name</span>) {
  <span style="color: #DEC77B;">return</span> <span style="color: #DEC77B;">this</span>.listing;
}

<span style="color: #6F8F6F;">/* </span><span style="color: #7F9F7F;">other functions left out */</span>
</pre>
</div>

<p>
We instantiate this FoodManager and assign it to some sort of view,
which shows whatever is currently listed there
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">foodManager</span> = <span style="color: #DEC77B;">new</span> <span style="color: #607060; text-decoration: underline;">FoodManager</span>();
<span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">foodView</span> = <span style="color: #DEC77B;">new</span> <span style="color: #607060; text-decoration: underline;">FoodView</span>(foodManager);
</pre>
</div>

<p>
Updating our food view might be as simple as adding new food items
to the manager (and refreshing the view)
</p>

<div class="org-src-container">

<pre class="src src-js">foodManager
  .addItem(<span style="color: #8CBED6;">"banana"</span>)
  .addItem(<span style="color: #8CBED6;">"apple"</span>)
  .addItem(<span style="color: #8CBED6;">"orange"</span>)
</pre>
</div>

<p>
But what if we want to access the data for the foodManager in a
different frame, iframe, or external window? Normally we could try
combing through the window.frames, or try going down through the
window.opener, but we can do better.
</p>

<p>
Let's extend the foodManager to be accessed from any frame, iframe,
or external window using <b>Penpal</b>.
</p>

<p>
First off, we need to define our <b>server prototype</b> using
<b>Penpal.newServer</b>.
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #6F8F6F;">//</span><span style="color: #7F9F7F;">This would be placed in a separate file, and the javascript src</span>
<span style="color: #6F8F6F;">//</span><span style="color: #7F9F7F;">would be shared among webpages.</span>
<span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">FoodServer</span> = Penpal.newServer(<span style="color: #8CBED6;">"FoodServer"</span>, {
  <span style="color: #D65921;">getFoodListing</span>: <span style="color: #DEC77B;">function</span>() {
    <span style="color: #DEC77B;">return</span> <span style="color: #DEC77B;">this</span>.getFoodListing();
  }
});
</pre>
</div>

<p>
Next, the <b>server prototype</b> needs to be instantiated, and the
foodManager instance that we wish to link to will be included as
the serverObject as an extension.
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #6F8F6F;">//</span><span style="color: #7F9F7F;">This would be called on the page including the foodManager instance</span>
FoodServer.start(<span style="color: #8CBED6;">"main-foodmanager"</span>, foodManager);
</pre>
</div>

<p>
Now, if we want to service this information to <i>anywhere else</i> in
our application, we would call it by instantiating a client to grab
that data.
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #6F8F6F;">//</span><span style="color: #7F9F7F;">some other frame, iframe, or external window</span>
<span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">foodClient</span> = FoodServer.newClient(<span style="color: #8CBED6;">"main-foodmanager"</span>);
foodClient.getFoodListing().then(<span style="color: #DEC77B;">function</span>(<span style="color: #EFA252;">listing</span>) {
  console.log(<span style="color: #8CBED6;">"The food listing"</span>, listing);
})
</pre>
</div>

<p>
Kind of magical, don't you think?
</p>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Examples of extending the server</h3>
<div class="outline-text-3" id="text-5-2">
<p>
If you plan on using the server standalone, you can pass in an
object when you first start a new server instance to configure the
server accordingly.
</p>

<p>
For example, we have a prefixed echo server that by default
prefixes the responses with "Hello"
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">PrefixedEchoServer</span> = <span style="color: #DEC77B;">function</span>(<span style="color: #8CBED6;">"EchoServer"</span>, {
  <span style="color: #D65921;">echo</span>: <span style="color: #DEC77B;">function</span>(<span style="color: #EFA252;">value</span>) {
    <span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">prefix</span> = <span style="color: #DEC77B;">this</span>.prefix || <span style="color: #8CBED6;">"Hello"</span>;
    <span style="color: #DEC77B;">return</span> prefix + <span style="color: #8CBED6;">" "</span> + value + <span style="color: #8CBED6;">"!"</span>
  }
});
</pre>
</div>

<p>
We can extend this server by providing a new prefix value
</p>

<div class="org-src-container">

<pre class="src src-js">PrefixedEchoServer(<span style="color: #8CBED6;">"pirate"</span>, {prefix: <span style="color: #8CBED6;">"Yarr"</span>});
PrefixedEchoServer(<span style="color: #8CBED6;">"german"</span>, {prefix: <span style="color: #8CBED6;">"Guten Tag"</span>})
</pre>
</div>

<p>
Calling these with clients will result in different outputs
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">pirateClient</span> = PrefixedEchoServer.newClient(<span style="color: #8CBED6;">"pirate"</span>)
  .echo(<span style="color: #8CBED6;">"Ben"</span>)
  .then(<span style="color: #DEC77B;">function</span>(<span style="color: #EFA252;">response</span>) {
    console.log(response); <span style="color: #6F8F6F;">//</span><span style="color: #7F9F7F;">Yarr Ben!</span>
  });

<span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">pirateClient</span> = PrefixedEchoServer.newClient(<span style="color: #8CBED6;">"german"</span>)
  .echo(<span style="color: #8CBED6;">"Ben"</span>)
  .then(<span style="color: #DEC77B;">function</span>(<span style="color: #EFA252;">response</span>) {
    console.log(response); <span style="color: #6F8F6F;">//</span><span style="color: #7F9F7F;">Guten Tag Ben!</span>
  });
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Handling errors</h3>
<div class="outline-text-3" id="text-5-3">
<p>
One thing that becomes more difficult when working with clients and
servers is handling cases where the server stops working, doesn't
exist, or receives invalid input arguments.
</p>

<p>
Fortunately, all of this is handled through the promise object, and
makes it easy to generate errors, and provide easy failover when things
don't go your way
</p>

<div class="org-src-container">

<pre class="src src-js">PickyFoodServer = Penpal.newServer(<span style="color: #8CBED6;">"PickyServer"</span>, {
  <span style="color: #D65921;">giveFood</span>: <span style="color: #DEC77B;">function</span>(<span style="color: #EFA252;">name</span>) {
    <span style="color: #DEC77B;">if</span> (name == <span style="color: #8CBED6;">"apple"</span>) {
      console.error(<span style="color: #8CBED6;">"Eww, I don't like apples"</span>);
      <span style="color: #DEC77B;">return</span> Penpal.ResponseCode.INVALID;
    }
    <span style="color: #DEC77B;">else</span> {
      <span style="color: #DEC77B;">return</span> <span style="color: #8CBED6;">"success"</span>;
    }
  }
});

#+BEGIN_SRC
PickyFoodServer.start(<span style="color: #8CBED6;">"main"</span>);

<span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">client</span> = PickyFoodServer.newClient(<span style="color: #8CBED6;">"main"</span>);
client.giveFood(<span style="color: #8CBED6;">"apple"</span>)
  .then(<span style="color: #DEC77B;">function</span>() {
    console.log(<span style="color: #8CBED6;">"this isn't called"</span>)
  })
  .fail(<span style="color: #DEC77B;">function</span>() {
    console.error(<span style="color: #8CBED6;">"this will be called"</span>);
  });
</pre>
</div>

<p>
Penpal also includes timeout functionality, which by default is set
to 5 seconds (5000 milliseconds). If you wish to increase or
decrease this timeout value, it can be supplied through the
client's optional arguments.
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #6F8F6F;">//</span><span style="color: #7F9F7F;">1ms is too short, so a timeout occurs</span>
<span style="color: #DEC77B;">var</span> <span style="color: #EFA252;">client</span> = PickyFoodServer.newClient(<span style="color: #8CBED6;">"main"</span>, {timeout: 1}) 
client.giveFood(<span style="color: #8CBED6;">"banana"</span>)
  .then(<span style="color: #DEC77B;">function</span>() {
    console.log(<span style="color: #8CBED6;">"this isn't called"</span>)
  })
  .fail(<span style="color: #DEC77B;">function</span>(<span style="color: #EFA252;">errCode</span>) {
    <span style="color: #DEC77B;">if</span> (errCode == Penpal.ResponseCode.INVALID) {
      console.error(<span style="color: #8CBED6;">"Invalid input... did you give the server apples?"</span>);
    }
    <span style="color: #DEC77B;">else</span> <span style="color: #DEC77B;">if</span> (errCode == Penpal.ResponseCode.TIMEOUT) {
      console.error(<span style="color: #8CBED6;">"Service Request Timeout"</span>);
    }
    <span style="color: #DEC77B;">else</span> {
      console.error(<span style="color: #8CBED6;">"Unknown error!"</span>);
    }
  });
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Javascript API</h2>
<div class="outline-text-2" id="text-6">
<p>
<i>work in progress</i>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-04-16 Thu&gt;</span></span></p>
<p class="author">Author: Benjamin Zaporzan</p>
<p class="date">Created: 2015-04-16 Thu 15:19</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.7c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
